In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#inline ploting
%matplotlib inline
import os
print(os.listdir())

['.ipynb_checkpoints', '911.csv', 'Book1.csv', 'Book2.xlsx', 'Data Preprocessing.ipynb', 'DataAnalysis911.ipynb', 'Matplotlib.ipynb', 'newCSV.csv', 'Numpy Basics.ipynb', 'Pandas.ipynb', 'preprocessing.csv', 'Seaborn.ipynb', '~$Book2.xlsx']

In [4]:
#laoding dataset
df=pd.read_csv("preprocessing.csv")
df

     State    Age  Pocket_Money Course_Purchased
0     Delhi  34.0        7200.0               No
1    Mumbai  17.0        4800.0              Yes
2  Banglore  20.0        5400.0               No
3    Mumbai  28.0        6100.0               No
4  Banglore  30.0           NaN              Yes
5     Delhi  25.0        5800.0              Yes
6    Mumbai   NaN        5200.0               No
7     Delhi  38.0        7900.0              Yes
8   Banlore  40.0        8300.0               No
9     Delhi  27.0        6700.0              Yes

In [5]:
df.head()

     State    Age  Pocket_Money Course_Purchased
0     Delhi  34.0        7200.0               No
1    Mumbai  17.0        4800.0              Yes
2  Banglore  20.0        5400.0               No
3    Mumbai  28.0        6100.0               No
4  Banglore  30.0           NaN              Yes

In [8]:
#separating Independent matrix datad from Dataset
X=df.iloc[:,:-1].values
X

array([['Delhi', 34.0, 7200.0],
       ['Mumbai', 17.0, 4800.0],
       ['Banglore', 20.0, 5400.0],
       ['Mumbai', 28.0, 6100.0],
       ['Banglore', 30.0, nan],
       ['Delhi', 25.0, 5800.0],
       ['Mumbai', nan, 5200.0],
       ['Delhi', 38.0, 7900.0],
       ['Banlore', 40.0, 8300.0],
       ['Delhi', 27.0, 6700.0]], dtype=object)

In [9]:
#separating dependent matrix datad from Dataset
y=df.iloc[:,3].values
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [12]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (1.1.3)
Requirement already satisfied: scipy>=1.3.2 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from scikit-learn) (1.9.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from scikit-learn) (1.23.2)
Requirement already satisfied: joblib>=1.0.0 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from scikit-learn) (1.2.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\zedbee technologies\appdata\local\programs\python\python310\lib\site-packages (from scikit-learn) (3.1.0)

[notice] A new release of pip available: 22.2.2 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [32]:
#Handling Missing Values
from sklearn.impute import SimpleImputer
import numpy as np
imputer = SimpleImputer(missing_values=np.NaN, strategy='mean')
imputer.fit(X[:,1:3])
X[:,1:3]=imputer.transform(X[:,1:3])
X

array([['Delhi', 34.0, 7200.0],
       ['Mumbai', 17.0, 4800.0],
       ['Banglore', 20.0, 5400.0],
       ['Mumbai', 28.0, 6100.0],
       ['Banglore', 30.0, 6377.777777777777],
       ['Delhi', 25.0, 5800.0],
       ['Mumbai', 28.77777777777778, 5200.0],
       ['Delhi', 38.0, 7900.0],
       ['Banlore', 40.0, 8300.0],
       ['Delhi', 27.0, 6700.0]], dtype=object)

In [34]:
#handle Categorical  data in our data
#https://towardsdatascience.com/label-encoder-and-onehot-encoder-in-python-83d32288b592
from sklearn.preprocessing import LabelEncoder
labelEncoder_X=LabelEncoder()